# Generated from packages.json — do not edit directly
# Regenerate with: gmake brewfile

tap "anomalyco/tap"

# --- common ---
brew "ack"
brew "fontconfig"
brew "xz"
brew "gdk-pixbuf"
brew "adwaita-icon-theme"
brew "agg"
brew "openssl@3"
brew "readline"
brew "asciinema"
brew "git"
brew "asdf"
brew "asimov"
brew "autoenv"
brew "python@3.11"
brew "autojump"
brew "bat"
brew "brew-cask-completion"
brew "brew-gem"
brew "openjdk"
brew "bundletool"
brew "chafa"
brew "cloudflare-wrangler"
brew "cloudflared"
brew "coreutils"
brew "dive"
brew "docker-completion"
brew "docker"
brew "eza"
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "ruby"
brew "gem-rake"
brew "gh"
brew "gifsicle"
brew "git-flow"
brew "git-lfs"
brew "git-open"
brew "gnu-sed"
brew "go"
brew "graphviz"
brew "grep"
brew "grip"
brew "gtk+3"
brew "gtksourceview4"
brew "gtop"
brew "htop"
brew "httpie"
brew "libomp"
brew "imagemagick"
brew "imagesnap"
brew "jj"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lazyjj"
brew "lazyjournal"
brew "llvm"
brew "lua"
brew "luarocks"
brew "mas"
brew "moreutils"
brew "navi"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "nvm"
brew "nvtop"
brew "podman"
brew "podman-compose"
brew "podman-tui"
brew "portaudio"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "sevenzip"
brew "shellcheck"
brew "tuckr"
brew "make"
brew "subversion"
brew "syncthing"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "ttyrec"
brew "uni"
brew "up"
brew "uv"
brew "watch"
brew "wget"
brew "yazi"
brew "yq"
brew "zlib"
brew "zsh"
brew "charmbracelet/tap/crush"
brew "anomalyco/tap/opencode"
brew "act"
brew "actionlint"
brew "beads"
brew "fastfetch"
brew "hugo"
brew "mactop"
brew "mise"
brew "python-tk@3.13"
brew "vim"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "android-platform-tools"
cask "balenaetcher"
cask "bartender"
cask "coteditor"
cask "docker-desktop"
cask "drawio"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "ghostty"
cask "github"
cask "gitup-app"
cask "google-chrome"
cask "handbrake-app"
cask "hex-fiend"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "little-snitch"
cask "lm-studio"
cask "obsidian"
cask "ollama-app"
cask "podman-desktop"
cask "rectangle"
cask "signal"
cask "syncthing-app"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zed"
cask "zen"
cask "aldente"
cask "anki"
cask "codex"
cask "cursor"
cask "cursor-cli"
cask "dotnet-sdk"
cask "google-drive"
cask "handbrake"
cask "mem"
cask "notion"
cask "notion-calendar"
cask "ollama"
cask "syncthing"
cask "virtualbox"
cask "zen-browser"

# --- private ---
cask "claude"
cask "calibre"
cask "kiro"
cask "ledger-live"
cask "ledger-wallet"
cask "thonny"

# --- entertainment ---
brew "godot"
cask "blender"
cask "cheetah3d"
cask "diffusionbee"
cask "discord"
cask "epic-games"
cask "gog-galaxy"
cask "steam"
cask "unity-hub"

# --- work ---
brew "dotnet"
brew "gradle"
brew "ios-deploy"
brew "k9s"
brew "kubectx"
brew "minikube"
brew "maven"
brew "mintoolkit"
brew "nginx"
brew "postgresql@15"
brew "openjdk@17"
brew "pandoc"
brew "pkgconf"
brew "stgit"
brew "tcl-tk"
brew "xcbeautify"
brew "xcodegen"
cask "app-tamer"
cask "dash@6"
cask "deltawalker"
cask "devonagent"
cask "ganttproject"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "paragon-ntfs"
cask "plasticscm-cloud-edition"
cask "portfolioperformance"
cask "screenflow"
cask "slack"
cask "snagit"
cask "teamviewer"
cask "thebrain"

# --- work-optional ---

