# Homebrew utilities
ack
act
adwaita-icon-theme
agg
asciinema
asimov
autoenv
bat
beads
brew-cask-completion
brew-gem
bundletool
chafa
cloudflare-wrangler
cloudflared
coreutils
dive
docker-completion|link: false
docker|link: false
dolt|restart_service: :changed
eza
fd
findutils
fontconfig
fzf
gawk
gdk-pixbuf
gem-rake
gh
gifsicle
git
git-flow
git-lfs
git-open
gnu-sed
go
graphviz
grep
grip
gtk+3
gtksourceview4
gtop
hey
htop
httpie
hugo
imagemagick
imagesnap
jj
jq
lazydocker
lazygit
lazyjj
lazyjournal
libomp
llvm
lua
luarocks
mactop
make
mas
mise
moreutils
navi
neovim
nmap
nvtop
openjdk
openssl@3
podman
podman-compose
podman-tui
portaudio
python@3.11
readline
ripgrep
ruby
sevenzip
shellcheck
starship
stow
subversion
syncthing|restart_service: :changed
tldr
tmux
tree
tree-sitter
tree-sitter-cli
ttyrec
uni
up
uv
watch
wget
xz
yazi
yq
zlib
zoxide
zsh
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting
opencode-ai/tap/opencode
