# Homebrew desktop apps
1password
1password-cli
alfred
android-platform-tools
anki
bartender
codex
copilot-cli
drawio
font-jetbrains-mono-nerd-font
fork
ghostty
github
gitup-app
handbrake-app
hex-fiend
imageoptim
istat-menus
iterm2
jetbrains-toolbox
little-snitch
lm-studio
notion
notion-calendar
obsidian
podman-desktop
rectangle
signal
syncthing-app
thebrain
virtualbox
visual-studio-code
vlc
warp
zed
