# Antidote plugin list for macOS/Linux
# Format: repo [kind:defer|kind:fpath|kind:theme]
# Loaded in order; zsh-syntax-highlighting must be last (eager)

# OMZ Compatibility & Theme
getantidote/use-omz
romkatv/powerlevel10k

# Completion & Utilities
zsh-users/zsh-completions kind:fpath

# Syntax & Suggestions (eager loading)
zsh-users/zsh-autosuggestions kind:defer
Aloxaf/fzf-tab kind:defer
zsh-users/zsh-syntax-highlighting

# OMZ Plugins (curated, via use-omz)
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/npm
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/macos
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/encode64

# Additional Utilities (deferred)
mattmc3/zsh-safe-rm kind:defer
